Repository: AreroKetahi/vChat
Catalog: vChat/Localizable/*.lproj/Localizable.strings
Languages: ar, de, ru, zh_hans, zh_hant

# ChatList.Chat
source: Chat
ar: للدردشة معه
de: Geplauder
ru: Nоболтать
zh_hans: 聊天
zh_hant: 通信

# ChatPage.Messages
source: Messages
ar: أدخل المعلومات
de: Nachrichten
ru: Введите информацию
zh_hans: 输入信息
zh_hant: 輸入消息

# ChatPage.Send
source: Send
ar: إرسال
de: Senden
ru: Отправить
zh_hans: 发送
zh_hant: 發送

# CloseAppLock.ButtonText
source: I know the issue and turn off App Lock.
zh_hans: 我知道问题并关闭App Lock。

# CloseAppLock.Definition
source: When App Lock is turned off, vChat open requests will not be protected.
zh_hans: 当App Lock关闭时，vChat打开的请求将不受保护。

# CloseAppLock.Primary.Title
source: Close App Lock
zh_hans: 关闭App Lock

# CloseAppLock.Secondary.CloseButton
source: Close App Lock
zh_hans: 关闭 App Lock

# CloseAppLock.Secondary.Title
source: Enter password to close App Lock
zh_hans: 输入密码以关闭App Lock

# ContactList.Contacts
source: Contacts
ar: دليل العناوين
de: Adressen
ru: Aдресная Kнига
zh_hans: 通讯录
zh_hant: 通訊薄

# ContactList.Details
source: Details
ar: معلومات اكثر
de: Nachrichten
ru: Более
zh_hans: 更多信息
zh_hant: 更多信息

# ContactPage.DownText
source: This is your friend which is added by his/her UID.
ar: هذا هو الصديق الذي أضفته من المعرف الفريد الخاص به.
de: Dies ist der Freund, den Sie aus seiner UID hinzugef端gt haben.
ru: Это друг, которого вы добавили по его/ее UID.
zh_hans: 这是你从他/她的UID添加的朋友。
zh_hant: 這是你從他/她的UID添加的朋友。

# ContactPage.Nickname
source: Nickname:
ar: كنية:
de: Spitzname:
ru: Никнейм:
zh_hans: 昵称：
zh_hant: 暱稱：

# ContactPage.SendingMessage
source: Send Messages
ar: إرسال رسالة
de: Nachricht senden
ru: Отправить Cообщение
zh_hans: 发信息
zh_hant: 發消息

# Entry.Chat
source: Chat
ar: للدردشة معه
de: Geplauder
ru: Nоболтать
zh_hans: 聊天
zh_hant: 通信

# Entry.Contacts
source: Contacts
ar: دليل العناوين
de: Adressen
ru: Aдресная Kнига
zh_hans: 通讯录
zh_hant: 通訊薄

# Entry.OriginTitle
source: Chat
ar: للدردشة معه
de: Geplauder
ru: Nоболтать
zh_hans: 聊天
zh_hant: 通信

# Entry.Preference
source: Preference
ar: اقامة
de: Aufbauen
ru: Настройки
zh_hans: 设置
zh_hant: 設定

# LockedPage.AppLocked
source: vChat is locked.
ar: تم قفل vChat.
de: vChat ist gesperrt.
ru: vChat заблокирован.
zh_hans: vChat已锁定。
zh_hant: vChat已鎖定。

# LockedPage.CanNotUse.FaceID
source: Your iPhone supports Face ID, but you didn't enable it in settings.
ar: يدعم iPhone الخاص بك Face ID ، لكنك لم تقم بتمكينه في الإعدادات.
de: Dein iPhone unterst端tzt Face ID, aber du hast es nicht in den Einstellungen aktiviert.
ru: Ваш iPhone поддерживает Face ID, но вы не включили его в настройках.
zh_hans: 你的iPhone支持面容ID，但是没有在设置中启用它。
zh_hant: 你的iPhone支持面容ID，但是沒有在設置中啟用。

# LockedPage.CanNotUse.Title
source: Whyï¼Ÿ
ar: لماذا ا؟
de: Wieso den?
ru: Почему?
zh_hans: 为什么？
zh_hant: 為什麼？

# LockedPage.CanNotUse.TouchID
source: Your iPhone supports Touch ID, but you didn't enable it in settings. Or your iPhone is iPhone 5 or lower, so Touch ID is not supported.
ar: يدعم iPhone الخاص بك معرف اللمس ولكنك لم تقم بتمكينه في الإعدادات. أو أن iPhone الخاص بك هو iPhone 5 أو أقل ، لذا فإن معرف اللمس غير مدعوم.
de: Ihr iPhone unterst端tzt Touch ID, aber Sie haben es in den Einstellungen nicht aktiviert. Oder Ihr iPhone ist iPhone 5 oder niedriger, sodass Touch ID nicht unterst端tzt wird.
ru: Ваш iPhone поддерживает Touch ID, но вы не включили его в настройках. Ваш iPhone может не поддерживать Touch ID, потому что это iPhone 5 или более ранней версии.
zh_hans: 您的 iPhone 支持触控ID，但您没有在设置中启用它。 或者您的 iPhone是 iPhone 5 或更低版本，所以不支持触控ID。
zh_hant: 您的 iPhone 支持觸控ID，但您沒有在設置中啓用它。 或者您的 iPhone是 iPhone 5 或更低版本，所以不支持觸控ID。

# LockedPage.CanNotUseBio%@
source: Why can't I use %@?
ar: لماذا لا يمكنني استخدام٪ @؟
de: Warum kann ich %@ nicht verwenden?
ru: Почему я не могу использовать %@?
zh_hans: 为什么我不能用%@？
zh_hant: 為什麼我不能用%@？

# LockedPage.EnterPassword
source: Please enter password
ar: الرجاء إدخال كلمة المرور
de: Bitte Passwort eingeben
ru: Пожалуйста введите пароль
zh_hans: 请输入密码
zh_hant: 請輸入密碼

# LockedPage.FaceID
source: Face ID
ar: معرف الوجه
zh_hans: 面容ID
zh_hant: 面容ID

# LockedPage.PasswordError
source: Wrong password!
ar: كلمة مرور خاطئة!
de: Falsches Passwort!
ru: Hеправильный пароль!
zh_hans: 密码错误！
zh_hant: 密碼錯誤！

# LockedPage.PasswordLess
source: Password must be at least eight characters
ar: يجب أن تتكون كلمة المرور من ثمانية أحرف على الأقل
de: Das Passwort muss mindestens acht Zeichen lang sein
ru: Пароль должен быть не менее восьми символов
zh_hans: 密码至少要有八位
zh_hant: 密碼至少要有八位

# LockedPage.PasswordPlaceholder
source: enter password...
ar: أدخل كلمة المرور ...
de: passwort eingeben...
ru: введите пароль...
zh_hans: 输入密码...
zh_hant: 輸入密碼...

# LockedPage.UnlockText %@
source: Unlock with %@
ar: فتح مع %@
de: Entsperren mit %@
ru: Используйте %@, чтобы pазблокировать
zh_hans: 使用%@解锁
zh_hant: 使用%@解鎖

# LockedPgae.TouchID
source: Touch ID
ar: معرف اللمس
zh_hans: 触控ID
zh_hant: 觸控ID

# PreferenceList.GlobalColorPicker
source: Accent Color
ar: لون التمييز
de: Akzentfarbe
ru: Aкцентный Цвет
zh_hans: 强调色
zh_hant: 重點高亮色

# PreferenceList.GlobalColorPicker.Preview
source: Accent Color Preview
ar: معاينة لون التمييز
de: Vorschau der Akzentfarbe
ru: Просмотр Aкцентного Цвета
zh_hans: 强调色预览
zh_hant: 重點高亮色預覽

# PreferenceList.GlobalColorPicker.Preview.Receive
source: Hello World!
ar: مرحبا بالعالم!
de: Hallo Welt!
ru: Привет, мир!
zh_hans: 你好世界！
zh_hant: 世界你好！

# PreferenceList.GlobalColorPicker.Preview.Sent
source: Hello!
ar: مرحبًا!
de: Hallo!
ru: Привет!
zh_hans: 你好！
zh_hant: 你好！

# PreferenceList.Preference
source: Preference
ar: اقامة
de: Aufbauen
ru: Настройки
zh_hans: 设置
zh_hant: 設定

# SetUpAppLock.Cancel
source: Cancel
zh_hans: 取消

# SetUpAppLock.Next
source: Next Step
zh_hans: 下一步

# SetUpAppLock.Primary.CertificatePlaceHolder
source: certificate...
zh_hans: 验证密码...

# SetUpAppLock.Primary.Match
source: Password matched
zh_hans: 密码已匹配

# SetUpAppLock.Primary.NoCertificate
source: Please authenticate password
zh_hans: 请验证密码

# SetUpAppLock.Primary.NoMatch
source: Password not match
zh_hans: 密码未匹配

# SetUpAppLock.Primary.SetPassword
source: Please set a password
zh_hans: 请设置密码

# SetUpAppLock.Primary.Title
source: First Step
zh_hans: 第一步

# SetUpAppLock.Secondary.Authenticate%@
source: Authenticate %@
zh_hans: 验证 %@

# SetUpAppLock.Secondary.Escape
source: Set it later...
zh_hans: 稍后设置...

# SetUpAppLock.Secondary.SubTitle%@
source: Enable %@
zh_hans: 启用 %@

# SetUpAppLock.Start.ButtonText
source: Set up App Lock
zh_hans: 注册 App Lock

# SetUpAppLock.Start.Definition.1
source: App Lock will protect your app from being used by others when you are not using vChat.
zh_hans: 当您不使用vChat时，App Lock将保护您的应用程序不被他人使用。

# SetUpAppLock.Start.Definition.2
source: When you are not using vChat, the app will automatically lock to keep your data safe.
zh_hans: 当您不使用vChat时，应用程序将会自动锁定以保护您的数据安全。

# SetUpAppLock.Start.Title
source: Get started with App Lock
zh_hans: 开始使用App Lock

# SetUpAppLock.Tertiary.Close
source: Close this page
zh_hans: 关闭此页面

# SetUpAppLock.Tertiary.Finish
source: Finish!
zh_hans: 完成！

# SetUpAppLock.Tertiary.Subtitle
source: App Lock is enable.
zh_hans: App Lock已启用。

# SetUpAppLock.Title
source: Set up App Lock
zh_hans: 注册App Lock

# SetUpAppLock.Title.2
source: Two steps in total
zh_hans: 共两步

# SetUpAppLock.Title.3
source: Three steps in total
zh_hans: 共三步

# SetupAppLock.Secondary.Title
source: Second Step
zh_hans: 第二步

# ContactPage.UID
source: UID:
ar: المعرف الفريد:

# Entry.NavigationBar.UID
source: UID:
ar: المعرف الفريد:
